{
  "locale": "en-us",
  "titles": {
    "about": "About Me",
    "skilleng": "Language Skills",
    "skilfra": "Skill in framework and library and tools",
    "workt": "Work experience and projects developed",
    "edugt": "Education"
  },
  "info": {
    "name": "Rafael Antonio Hidalgo Romero",
    "post": "Full stack developer and technology consultant with over 7 years of experience in large-scale development, specialized in microservices architectures, distributed systems, and cloud solutions.",
    "workitems": [
      {
        "work": "Technology Consultant and Developer",
        "emp": "at Zerviz (Consultancy)",
        "time": "March, 2021 - Present",
        "descrip": "Technology consultant for diverse international clients:\n• Millicom (TIGO): Implementation of AWS Lambda services, React and Zendesk development, Zendesk to Chatwoot migration across 9 countries using Vue.js and Ruby on Rails.\n• Copa Airlines: Creation of Five9 scripts to improve voice integration.\n• Rosen: Microservices development with Spring Boot and Azure DevOps pipeline management.\n• Abcdin: Backend development with Node.js, TypeScript, NestJS, and SQS consumers for AWS.\nTechnologies: Node.js, TypeScript, NestJS, React.js, Vue.js, Ruby on Rails, SQS, Azure DevOps, Spring Boot, Java."
      },
      {
        "work": "Senior Backend Developer",
        "emp": "at ZeroQ (Chile)",
        "time": "September, 2021 - Present",
        "descrip": "Development of backend systems specialized in real-time communications and customer service. Implementation of WebSocket architectures for chat and technical support systems. Development with Go and Node.js, focused on high concurrency and scalability for customer service platforms."
      },
      {
        "work": "Backend Coordinator and Developer",
        "emp": "at Sigeme (Freelance - Guatemala)",
        "time": "June, 2021 - Present",
        "descrip": "Development and coordination of the SGC commercial system from planning to final implementation. Implementation of batch billing programs using Cobol, significantly improving billing process efficiency. Constant communication with clients to ensure project success and delivery of customized solutions.\nTechnologies: Cobol, SQL, batch systems."
      },
      {
        "work": "Desarrollador full stack and PM",
        "emp": "at AnanaSoft (Costa Rica)",
        "time": "June, 2021 - January, 2022",
        "descrip": "Freelance developer in real estate systems with React.js and serveless technologies."
      },
      {
        "work": "Coordinator and Developer",
        "emp": "at The Data Age",
        "time": "March, 2017 - June, 2021",
        "descrip": "Led the development of the O-SGC commercial system, managing a multidisciplinary development team. Implemented REST API using Golang and managed development environments with Docker. Created certification daemon developed in Golang and Python for electronic billing systems. Coordinated developments carrying out solution analysis, planning and task assignment, monitoring modifications and system implementations, specializing in batch biller program development.\nTechnologies: Golang, Python, Docker, SQL, REST API, batch systems."
      },
      {
        "work": "Electronic billing project in Energuate Guatemala",
        "emp": "a the data age",
        "time": "August, 2019 - December, 2019",
        "descrip": "Coordination of developments in the electronic certification system or FEL for Energuate in charge of creating the demon that communicates with SAT of Guatemala to sign the invoices of the commercial system"
      },
      {
        "work": "Electronic billing project in Salvador AES",
        "emp": "a the data age",
        "time": "August, 2020 - June, 2021",
        "descrip": "Coordination of developments in the electronic certification system or FEL for Aes in charge of creating the demon that communicates with the Hacienda de Salvador to sign the invoices of the commercial system, this certifies the legal documents of the company"
      },
      {
        "work": "Rest api support",
        "emp": "at Workana",
        "time": "March, 2020 - January, 2022",
        "descrip": "AWS service support in golang creating new requests."
      },
      {
        "work": "Crazysales Project",
        "emp": "at Loterial publishes",
        "time": "May, 2020 - August, 2020",
        "descrip": "Ticketa flutter project for public lotteries."
      }
    ],
    "educationitems": [
      {
        "work": "Computer Engineering",
        "emp": "Polytechnic University of Nicaragua",
        "time": "March 2014 - December 2018",
        "descrip": "Computer Engineering is an academic program that trains highly skilled professionals to design, develop, and maintain complex computational systems, integrating both hardware and software. During this degree, I developed competencies to apply innovative information technology across various business and scientific areas.\n\nAs a computer engineer, I acquired expertise in solving complex problems through technology and innovation, with a focus on distributed systems, software architectures, and digital device integration. The training included analysis, design, and evaluation of systems that meet the technological and functional needs of modern organizations, preparing me to lead large-scale technological projects."
      }
    ],
    "aboutmeitems": [
      {
        "title": "Age",
        "val": "DYNAMIC_AGE"
      },
      {
        "title": "Email",
        "val": "rafael180496@gmail.com"
      },
      {
        "title": "Phone",
        "val": "+505-8884-2174"
      },
      {
        "title": "Addres",
        "val": "Doral city, Managua km 18, Nicaragua"
      },
      {
        "title": "Identification",
        "val": "001-180496-0013A"
      }
    ],
    "lib_skills": [
      {
        "title": "React(JS)",
        "val": 60
      },
      {
        "title": "NodeJS",
        "val": 80
      },
      {
        "title": "NestJS",
        "val": 80
      },
      {
        "title": "Grahql(JS,GO)",
        "val": 40
      },
      {
        "title": "Boostrap(Css)",
        "val": 70
      },
      {
        "title": "NodeJS(JS)",
        "val": 90
      },
      {
        "title": "GORM(GO)",
        "val": 80
      },
      {
        "title": "Flutter(Dart)",
        "val": 80
      },
      {
        "title": "Asp .net MVC(C#)",
        "val": 60
      },
      {
        "title": "Git",
        "val": 90
      },
      {
        "title": "Docker,Docker Compose",
        "val": 80
      },
      {
        "title": "Aws",
        "val": 50
      },
      {
        "title": "Heroku",
        "val": 75
      },
      {
        "title": "Oracle",
        "val": 90
      },
      {
        "title": "PostgreSQL",
        "val": 90
      }
    ],
    "language_skills": [
      {
        "title": "Javascript",
        "val": 90
      },
      {
        "title": "Typescript",
        "val": 90
      },
      {
        "title": "Golang",
        "val": 100
      },
      {
        "title": "C#",
        "val": 60
      },
      {
        "title": "COBOL",
        "val": 70
      },
      {
        "title": "PYTHON",
        "val": 80
      },
      {
        "title": "Pro C",
        "val": 70
      },
      {
        "title": "PL/SQL",
        "val": 90
      },
      {
        "title": "CSS",
        "val": 40
      },
      {
        "title": "HTML",
        "val": 60
      },
      {
        "title": "Kotlin",
        "val": 50
      },
      {
        "title": "Dart",
        "val": 60
      },
      {
        "title": "Visual Basic",
        "val": 50
      }
    ],
    "social": [
      {
        "name": "Githud",
        "icon": "fab fa-github",
        "link": "https://github.com/rafael180496"
      },
      {
        "name": "Linkedin",
        "icon": "fab fa-linkedin-in",
        "link": "https://www.linkedin.com/in/rafael-antonio-hidalgo-romero-71608a116/"
      }
    ],
    "aboutme": "I'm Rafael, a full stack developer and technology consultant with over 7 years of experience creating innovative solutions for international companies. I specialize in microservices architectures, distributed systems, and cloud technologies, having worked with clients like Millicom (TIGO), Copa Airlines, and Rosen on large-scale projects.\n\nMy passion lies in transforming complex ideas into robust and scalable systems. I have experience leading development teams from conceptualization to implementation, using technologies like Node.js, Golang, React, Vue.js, and AWS and Azure platforms.\n\nI enjoy tackling technical challenges that require creative solutions, especially in high-concurrency systems, REST APIs, and complex integrations. My goal is always to deliver real value through clean code, solid architectures, and effective collaboration."
  }
}
