{
  "locale": "en-mx",
  "titles": {
    "about": "Sobre mi",
    "skilleng": "Lenguajes de Programación",
    "skilfra": "Frameworks, Herramientas y Plataformas",
    "workt": "Experiencia laboral y proyectos elaborados",
    "edugt": "Educacion"
  },
  "info": {
    "name": "Rafael Antonio Hidalgo Romero",
    "post": "Desarrollador full stack y consultor tecnológico con DYNAMIC_EXPERIENCE_YEARS años de experiencia en desarrollos a gran escala, especializado en arquitecturas de microservicios, sistemas distribuidos y soluciones cloud.",
    "workitems": [
      {
        "work": "Consultor Tecnológico y Desarrollador",
        "emp": "en Zerviz (Consultoría)",
        "time": "Marzo,2021 - Presente",
        "descrip": "Consultor tecnológico para diversos clientes internacionales:\n• Millicom (TIGO): Implementación de servicios AWS Lambda, desarrollo con React y Zendesk, migración de Zendesk a Chatwoot en 9 países con Vue.js y Ruby on Rails.\n• Copa Airlines: Creación de scripts en Five9 para mejorar la integración de voz.\n• Rosen: Desarrollo de microservicios con Spring Boot y gestión de pipelines en Azure DevOps.\n• Abcdin: Desarrollo de backend con Node.js, TypeScript, NestJS y consumidores SQS para AWS.\nTecnologías: Node.js, TypeScript, NestJS, React.js, Vue.js, Ruby on Rails, SQS, Azure DevOps, Spring Boot, Java."
      },
      {
        "work": "Desarrollador Backend Senior",
        "emp": "en ZeroQ (Chile)",
        "time": "Septiembre,2021 - Presente",
        "descrip": "Desarrollo de sistemas backend especializados en comunicaciones en tiempo real y atención al cliente. Implementación de arquitecturas con WebSockets para sistemas de chat y soporte técnico. Desarrollo con Go y Node.js, enfocado en alta concurrencia y escalabilidad para plataformas de atención al cliente."
      },
      {
        "work": "Coordinador y Desarrollador Backend",
        "emp": "en Sigeme (Freelance - Guatemala)",
        "time": "Junio,2021 - Presente",
        "descrip": "Desarrollo y coordinación del sistema comercial SGC desde la planificación hasta la implementación final. Implementación de programas para facturación batch utilizando Cobol, mejorando significativamente la eficiencia del proceso de facturación. Mantenimiento de comunicación constante con clientes para garantizar el éxito de cada proyecto y entrega de soluciones personalizadas.\nTecnologías: Cobol, SQL, sistemas batch."
      },
      {
        "work": "Desarrollador full stack",
        "emp": "en AnanaSoft (Costa Rica)",
        "time": "Junio,2021 - Enero,2022",
        "descrip": "Desarrollador freelance en sistemas de inmuebles con tecnologias React.js y serveless."
      },
      {
        "work": "Coordinador y Desarrollador",
        "emp": "en The Data Age",
        "time": "Marzo,2017 - Junio,2021",
        "descrip": "Lideré el desarrollo del sistema comercial O-SGC, gestionando un equipo de desarrollo multidisciplinario. Implementé API REST utilizando Golang y administré entornos de desarrollo con Docker. Creación de demonio certificador elaborado en Golang y Python para sistemas de facturación electrónica. Coordinación de desarrollos llevando a cabo análisis de soluciones, planificación y asignación de tareas, seguimiento de modificaciones e implementaciones de sistemas, especializándose en el desarrollo de programas de facturador batch.\nTecnologías: Golang, Python, Docker, SQL, API REST, sistemas batch."
      },
      {
        "work": "Proyecto de Facturación Electrónica en Energuate Guatemala",
        "emp": "en The Data Age",
        "time": "Agosto,2019 - Diciembre,2019",
        "descrip": "Coordinación de desarrollos en el sistema de certificación electrónica o FEL para Energuate, encargado de crear el demonio que se comunica con SAT de Guatemala para firmar las facturas del sistema comercial"
      },
      {
        "work": "Proyecto de Facturación Electrónica en El Salvador AES",
        "emp": "en The Data Age",
        "time": "Agosto,2020 - Junio,2021",
        "descrip": "Coordinación de desarrollos en el sistema de certificación electrónica o FEL para AES, encargado de crear el demonio que se comunica con Hacienda de El Salvador para firmar las facturas del sistema comercial. Esto certifica los documentos legales de la empresa."
      },
      {
        "work": "Soporte de API REST",
        "emp": "en Workana",
        "time": "Marzo,2020 - Enero,2022",
        "descrip": "Soporte de servicios AWS en Golang creando nuevas peticiones y endpoints."
      },
      {
        "work": "Proyecto Crazysales",
        "emp": "en Lotería Pública",
        "time": "Mayo,2020 - Agosto,2020",
        "descrip": "Proyecto en Flutter de ticketing para loteros públicos."
      }
    ],
    "educationitems": [
      {
        "work": "Ingeniería en Computación",
        "emp": "Universidad Politécnica de Nicaragua",
        "time": "Marzo 2014 - Diciembre 2018",
        "descrip": "La Ingeniería en Computación es un programa académico que forma profesionales altamente capacitados para diseñar, desarrollar y mantener sistemas computacionales complejos, integrando tanto hardware como software. Durante esta carrera desarrollé competencias para aplicar tecnología informática innovadora en diversas áreas empresariales y científicas.\n\nComo ingeniero en computación, adquirí expertise en la resolución de problemas complejos a través de la tecnología y la innovación, con enfoque en sistemas distribuidos, arquitecturas de software, y la integración de dispositivos digitales. La formación incluyó análisis, diseño y evaluación de sistemas que satisfacen necesidades tecnológicas y funcionales de organizaciones modernas, preparándome para liderar proyectos tecnológicos de gran escala."
      }
    ],
    "aboutmeitems": [
      {
        "title": "Edad",
        "val": "DYNAMIC_AGE"
      },
      {
        "title": "Correo",
        "val": "rafael180496@gmail.com"
      },
      {
        "title": "Telefono",
        "val": "+505-8884-2174"
      },
      {
        "title": "Dirección",
        "val": "Ciudad Doral, Managua km 18, Nicaragua"
      },
      {
        "title": "Identificacion",
        "val": "001-180496-0013A"
      }
    ],
    "social": [
      {
        "name": "GitHub",
        "icon": "fab fa-github",
        "link": "https://github.com/rafael180496"
      },
      {
        "name": "Linkedin",
        "icon": "fab fa-linkedin-in",
        "link": "https://www.linkedin.com/in/rafael-antonio-hidalgo-romero-71608a116/"
      }
    ],
    "aboutme": "Soy Rafael, un desarrollador full stack y consultor tecnológico con DYNAMIC_EXPERIENCE_YEARS años de experiencia creando soluciones innovadoras para empresas internacionales. Me especializo en arquitecturas de microservicios, sistemas distribuidos y tecnologías cloud, habiendo trabajado con clientes como Millicom (TIGO), Copa Airlines y Rosen en proyectos de gran escala.\n\nMi pasión radica en transformar ideas complejas en sistemas robustos y escalables. Tengo experiencia liderando equipos de desarrollo, desde la conceptualización hasta la implementación, utilizando tecnologías como Node.js, Golang, React, Vue.js y plataformas AWS y Azure.\n\nDisfruto enfrentar desafíos técnicos que requieren soluciones creativas, especialmente en sistemas de alta concurrencia, APIs REST, y integraciones complejas. Mi objetivo es siempre entregar valor real a través de código limpio, arquitecturas sólidas y colaboración efectiva."
  }
}
